[
  {
    "title": "Nov 10 2023",
    "content": "NOTICE: November-10th-2023. 'Pressure' for isotopic4096 dataset is not working. And cutout services are slow and unreliable at the moment. We are working on fixing it. Thank you for your patience."
  },
  {
    "title": "Nov 7 2023",
    "content": "NOTICE: November-7th-2023. All datasets listed are accessible for web queries. However cutout services are slow and unreliable at the moment. We are working on fixing it. Thank you for your patience."
  },
  {
    "title": "Jul 8 2021",
    "content": "July-08-2021. Some of our disks containing data for the transition_bl, channel 5200 and isotropic8192 datasets are having some technical difficulties. We are working to fix the problems."
  },
  {
    "title": "May 19 2021",
    "content": "May-19-2021. JHTDB team mourns the loss of our dear friend and colleague Jan Vandenberg, who passed away on May 13, succumbing to cancer. He was one of the key originators of JHTDB and the turbulence database group will miss him dearly."
  },
  {
    "title": "May 5 2021",
    "content": "May-05-2021.The cutout service queue for the transition_bl and isotropic8192 datasets appears to be having some technical difficulties. We are working on the problem."
  },
  {
    "title": "Sep 22 2020",
    "content": "Sep-22-2020. Announcing a new dataset: JHTDB now hosts 6 snapshots of a 8192<sup>3</sup> DNS of forced isotropic turbulence, generated by Dr. PK Yeung and his team. Five snapshots are at Re? ~ 1,300 while one snapshot is at Re? ~ 610, highly resolved with kmax ? = 5.3. See \"Documentation\" for \"Dataset description\" (note: for the time being, access via cutout is limited to subcubes up to 1024<sup>3</sup>)."
  },
  {
    "title": "Aug 12 2020",
    "content": "Aug-12-2020. On August 17, 2020 starting at 7:00am EST and lasting for about 1 hour, connectivity to JHTDB may be impaired due to scheduled repairs to the network fibers."
  },
  {
    "title": "Apr 28 2020",
    "content": "Apr-28-2020. Servers are functioning normally. Notice to users of the “channel5200” dataset: The pressure returned by the system is the pressure fluctuation only, i.e. it does not include the y-dependent mean pressure (or does it include the mean pressure gradient in the x-direction). While we work on adding the mean pressure to this dataset, if you need the mean pressure included now, you may use the tabulated value <a href=\"http://turbulence.oden.utexas.edu/channel2015/data/LM_Channel_5200_mean_prof.dat\" target=\"_blank\">here </a> (this does not apply to the “channel” Re=1000 dataset for which the mean pressure is included)."
  },
  {
    "title": "Sep 16 2019",
    "content": "Sep-16-2019. A new and improved cutout service is now available. For more details and new sign-in requirement, see <a href=\"http://turbulence.pha.jhu.edu/newcutout.aspx\" target=\"_blank\">here</a>. GetRaw... functions (GetRawVelocity, GetRawPressure etc.) are deprecated and replaced by GetCutout. GetThreshold function now uses 1-based indexing. Servers are functioning normally."
  },
  {
    "title": "Jul 22 2019",
    "content": "Jul-22-2019. A new and improved cutout service is now available for public testing. For more details and new sign-in requirement, see <a href=\"http://turbulence.pha.jhu.edu/newcutout.aspx\" target=\"_blank\">here</a>. The current old cutout service will be discontinued in the near future, approximately from September 1, 2019. Servers are functioning normally."
  },
  {
    "title": "Nov 30 2018",
    "content": "Nov-30-2018. We are currently experiencing issues with channel5200 and transition_bl datasets.We are currently working on fixing this issue."
  },
  {
    "title": "Nov 10 2018",
    "content": "Nov-10-2018: The bugs in isotropic1024 have been fixed. Servers are functioning normally."
  },
  {
    "title": "Nov 2 2018",
    "content": "Nov-02-2018: Some servers for the isotropic1024 are unstable. We are working to fix the problem."
  },
  {
    "title": "Oct 9 2018",
    "content": "Oct-09-2018: Notice to users of the isotropic turbulence (isotropic1024coarse) dataset: we have recently found a database ingest bug affecting the isotropic1024coarse dataset for times t > 2.048. The stored data on the two planes x=2π-dx=6.277049 (i=Nx) and y=2π-dy=6.277049 (j=Ny) were set equal to the data on the planes x=2π (i=1) and y=2π (j=1). We are working to remedy the problem."
  },
  {
    "title": "Jul 18 2018",
    "content": "Jul-18-2018. The services will be down and unavailable for around 10 minutes between 14:00-15:00 on July 19, 2018 for important updates. Servers are currently functioning normally."
  },
  {
    "title": "Jul 3 2018",
    "content": "Jul-03-2018. A new dataset (11 snapshots from channel flow at Re<sub>τ</sub>=5200 from UT Austin) has been added to JHTDB. Servers are currently functioning normally."
  },
  {
    "title": "May 7 2018",
    "content": "May-07-2018: A new dataset (DNS of bypass transitional boundary layer up to Re_theta=1502) has been added to JHTDB. The entire time evolution over a flow-through time (4701 snapshots) is stored. Servers are functioning normally."
  },
  {
    "title": "Feb 27 2018",
    "content": "Feb-27-2018. Attention: a bug has been identified in the GetVelocityAndPressure function applied to the channel flow that causes the returned pressure values to be at shifted x-locations. The bug has now been corrected. Please contact us if you have any questions about this issue"
  },
  {
    "title": "Jan 31 2018",
    "content": "January-31-2018. A new dataset (5 snapshots from rotating stratified turbulence on a 4096-cubed domain generated using the GHOST code) has been added to JHTDB. Servers are currently functioning normally"
  },
  {
    "title": "Nov 6 2017",
    "content": "6-November-2017. A new dataset (a single snapshot from isotropic turbulence on a 4096-cubed domain generated by Georgia Tech researchers) has been added to JHTDB. Also, a new getFunction (getInvariant) now allows to evaluate the square of strain and rotation rate tensors. Some other minor bugs were fixed. Servers are currently functioning normally."
  },
  {
    "title": "Oct 12 2017",
    "content": "12 October 2017:Servers are currently functioning normally. Note that the getThreshold functionality when invoked for Q criterion is returning |Q| rather that Q. We will soon fix this problem."
  },
  {
    "title": "Aug 9 2017",
    "content": "9 August, 2017: 9 August 2017:We are currently having issues with the cutout service. We are trying to resolve this quickly. Smaller chunks of data can still be accessed through the cutout service, for larger data please use the other access methods for now."
  },
  {
    "title": "May 22 2017",
    "content": "22 May, 2017: We are currently experiencing disk problems on one of our servers. The channel flow and mixing datasets are not functioning normally at this time. We are working to correct the issue."
  },
  {
    "title": "May 18 2017",
    "content": "18 May, 2017: We will be patching servers from 10AM EDT to 12PM EDT on 19 May 2017. Services may not work during this period."
  },
  {
    "title": "May 2 2017",
    "content": "We will be patching servers from 10am to 12pm on 2 May. This may cause service interruptions during this time."
  },
  {
    "title": "Feb 21 2017",
    "content": "We will be patching servers on 21 February beginning at 12:00 EST, therefore some services may not be available for short periods of times."
  },
  {
    "title": "Nov 20 2016",
    "content": "GetPosition currently does not work on the extended dataset."
  },
  {
    "title": "Oct 19 2016",
    "content": "NOTICE: 19 October, 2016: We have extended our Isotropic 1024 coarse dataset to time 10.056. Please let us know at <a href=\"mailto:turbulence@lists.johnshopkins.edu\">turbulence@lists.johnshopkins.edu</a> if you run into any issues with this updated dataset. <span style=\"color: #ff0000\">We are currently testing particle tracking in this new region.</span>"
  },
  {
    "title": "Jul 18 2016",
    "content": "Channel Database nodes are experiencing hardware failures. We are working to resolve this quickly, but channel data may be unavailable."
  },
  {
    "title": "Jun 13 2016",
    "content": "We are currently experiencing networking issues within our server network. This is leading to timeouts on data access. We are currently working on fixing this issue."
  },
  {
    "title": "Apr 26 2016",
    "content": "We are currently experiencing issues with our servers, and some queries may time out. We are currently working on resolving the problems."
  },
  {
    "title": "Feb 23 2016",
    "content": "The following announcement pertains to getPosition queries on the channel dataset using Lag4, Lag6, or Lag8 spatial interpolation, performed on or before February 23, 2016. On this date, a bug was identified in the database code. The effect of the bug was to produce an inaccurate spatial interpolation of the velocities used to update the Lagrangian position. The error occurred on every 8th y-location, in the upper half of the channel (0 < y < 1). The bug has been fixed on February 23, 2016. We regret any user inconvenience this may have caused."
  }
]